# Data Mining project: Discover and describe areas of interest and events from geo-located data

## 1. Import Dataset and Libraries

In [125]:
# load pandas to deal with the data
import pandas as pd
# plotting
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [126]:
# load data from table file where entries are separated with a space
data = pd.read_table("flickr_data2.csv", sep=",", low_memory=False)

data.columns = data.columns.str.strip()

print(data.columns)
print(data.info())
print(data.describe())
data.head()

Index(['id', 'user', 'lat', 'long', 'tags', 'title', 'date_taken_minute',
       'date_taken_hour', 'date_taken_day', 'date_taken_month',
       'date_taken_year', 'date_upload_minute', 'date_upload_hour',
       'date_upload_day', 'date_upload_month', 'date_upload_year',
       'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 420240 entries, 0 to 420239
Data columns (total 19 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  420240 non-null  int64
 1   user                420240 non-null  object
 2   lat                 420240 non-null  float64
 3   long                420240 non-null  float64
 4   tags                316730 non-null  object
 5   title               381911 non-null  object
 6   date_taken_minute   420239 non-null  float64
 7   date_taken_hour     420240 non-null  int64
 8   date_taken_day      420240 non-null  int64
 9   date_taken_month    420240 non-null  int64
 10  date_taken_year     420240 non-null  int64
 11  date_upload_minute  420228 non-null  object
 12  date_upload_hour    420238 non-null  object
 13  date_upload_day     420238 non-null  float64
 14  date_upload_month   420240 non-null  int64
 15  date_upload_year    420239 non-null  float64
 16  Unnamed: 16         142 non-null     float64
 17  Unnamed: 17         0 non-null       float64
 18  Unnamed: 18         2 non-null       float64
dtypes: float64(8), int64(6), object(5)
memory usage: 60.9+ MB
None
                 id            lat           long  date_taken_minute  \
count  4.202400e+05  420240.000000  420240.000000      420239.000000
mean   2.002697e+10      45.768173       4.839672          30.068559
std    1.411384e+10       0.028575       0.031619          39.880117
min    3.066675e+08      45.655200       4.720312           0.000000
25%    7.094503e+09      45.757613       4.826202          14.000000
50%    1.548087e+10      45.763152       4.832183          30.000000
75%    3.145886e+10      45.773509       4.846558          45.000000
max    4.914809e+10      45.854950       5.006709        2019.000000

       date_taken_hour  date_taken_day  date_taken_month  date_taken_year  \
count    420240.000000   420240.000000     420240.000000    420240.000000
mean         14.746695       15.456813          7.000493      2013.294256
std           6.583236        9.637870          4.611831        37.141359
min           0.000000        1.000000          1.000000         1.000000
25%          12.000000        8.000000          4.000000      2012.000000
50%          15.000000       15.000000          7.000000      2014.000000
75%          18.000000       23.000000         10.000000      2017.000000
max        2013.000000     2013.000000       2011.000000      2238.000000

       date_upload_day  date_upload_month  date_upload_year  Unnamed: 16  \
count    420238.000000      420240.000000     420239.000000   142.000000
mean         16.398738           6.698277       2013.648624  1958.880282
std           8.450967           4.672163         37.006109   331.444924
min           0.000000           1.000000          1.000000    12.000000
25%           9.000000           4.000000       2012.000000  2013.000000
50%          17.000000           7.000000       2014.000000  2016.000000
75%          24.000000          10.000000       2017.000000  2016.000000
max          31.000000        2011.000000       2019.000000  2019.000000

       Unnamed: 17  Unnamed: 18
count          0.0          2.0
mean           NaN       2012.0
std            NaN          0.0
min            NaN       2012.0
25%            NaN       2012.0
50%            NaN       2012.0
75%            NaN       2012.0
max            NaN       2012.0

,id,user,lat,long,tags,title,date_taken_minute,date_taken_hour,date_taken_day,date_taken_month,date_taken_year,date_upload_minute,date_upload_hour,date_upload_day,date_upload_month,date_upload_year,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,4395181099,30624617@N03,45.754858,4.821710,"chair,lyon,rhône,chaise,rhônealpes",Chaises avec vue,11.0,15,28,2,2010,23,20,28.0,2,2010.0,NaN,NaN,NaN
1,4394748717,35853470@N00,45.753270,4.862953,NaN,NaN,51.0,17,28,2,2010,52,17,28.0,2,2010.0,NaN,NaN,NaN
2,4394694699,11817998@N05,45.760655,4.846564,"365,iphone",59/365 - R46 V103 B163,29.0,17,28,2,2010,33,17,28.0,2,2010.0,NaN,NaN,NaN
3,4394803790,11545749@N06,45.784000,4.874072,"nin,nineinchnails,gift,screening,toiou,avott",2010-01-29 Toiou Avott Lyon,15.0,20,28,1,2010,38,12,28.0,2,2010.0,NaN,NaN,NaN
4,4394803554,11545749@N06,45.784000,4.874072,"lyon,nin,nineinchnails,gift,screening,toiou,avott",2010-01-28 Toiou Avott Lyon,10.0,20,28,1,2010,38,12,28.0,2,2010.0,NaN,NaN,NaN

## Perform Exploratory Data Analysis
First, we will explore the most common **data quality issues**:
* missing-vals
* duplicates

Second, we will use [**descriptive statistics**](#desc-stats) to have get a statistical summary of the data. 

We will then use [**data visualisaiton**](#data-vis) to get a better understanding of the data.

### Wrong type values

In [145]:
# Affiche la taille initiale
print(f"Initial: {len(data)}")
print(data.iloc[98811])

# Dictionnaire des règles de validation
validation_rules = {
    'lat': lambda x: pd.api.types.is_number(x) and 45.69804 <= x <= 45.79972,
    'long': lambda x: pd.api.types.is_number(x) and 4.76075 <= x <= 4.93901,
    'date_taken_minute': lambda x: pd.api.types.is_number(x) and 0 <= x <= 59,
    'date_taken_hour': lambda x: pd.api.types.is_number(x) and 0 <= x <= 23,
    'date_taken_day': lambda x: pd.api.types.is_number(x) and 1 <= x <= 31,
    'date_taken_month': lambda x: pd.api.types.is_number(x) and 1 <= x <= 12,
    'date_taken_year': lambda x: pd.api.types.is_number(x) and 1900 <= x <= 2100,
    'date_upload_minute': lambda x: pd.api.types.is_number(x) and 0 <= x <= 59,
    'date_upload_hour': lambda x: pd.api.types.is_number(x) and 0 <= x <= 23,
    'date_upload_day': lambda x: pd.api.types.is_number(x) and 1 <= x <= 31,
    'date_upload_month': lambda x: pd.api.types.is_number(x) and 1 <= x <= 12,
    'date_upload_year': lambda x: pd.api.types.is_number(x) and 1900 <= x <= 2100,
}

# Fonction de nettoyage des colonnes
def clean_column(dataframe, column_name, validation_func):
    dataframe[column_name] = dataframe[column_name].apply(
        lambda x: x if validation_func(x) else np.nan
    )

# Appliquer les règles de validation à chaque colonne
for column, rule in validation_rules.items():
    if column in data.columns:
        clean_column(data, column, rule)

print(data.iloc[98811])
data.head()

Initial: 420240
id                    7.387935e+09
user                           NaN
lat                   4.576869e+01
long                  4.843872e+00
tags                           NaN
title                          NaN
date_taken_minute     5.800000e+01
date_taken_hour       1.500000e+01
date_taken_day        1.600000e+01
date_taken_month      6.000000e+00
date_taken_year       2.012000e+03
date_upload_minute    2.000000e+00
date_upload_hour      2.000000e+01
date_upload_day       1.700000e+01
date_upload_month     6.000000e+00
date_upload_year      2.012000e+03
Unnamed: 16                    NaN
Unnamed: 17                    NaN
Unnamed: 18                    NaN
Name: 98811, dtype: float64
id                    7.387935e+09
user                           NaN
lat                   4.576869e+01
long                  4.843872e+00
tags                           NaN
title                          NaN
date_taken_minute     5.800000e+01
date_taken_hour       1.500000e+01
date_taken_day        1.600000e+01
date_taken_month      6.000000e+00
date_taken_year       2.012000e+03
date_upload_minute    2.000000e+00
date_upload_hour      2.000000e+01
date_upload_day       1.700000e+01
date_upload_month     6.000000e+00
date_upload_year      2.012000e+03
Unnamed: 16                    NaN
Unnamed: 17                    NaN
Unnamed: 18                    NaN
Name: 98811, dtype: float64

,id,user,lat,long,tags,title,date_taken_minute,date_taken_hour,date_taken_day,date_taken_month,date_taken_year,date_upload_minute,date_upload_hour,date_upload_day,date_upload_month,date_upload_year,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,4.395181e+09,NaN,45.754858,4.821710,NaN,NaN,11.0,15.0,28.0,2.0,2010.0,23.0,20.0,28.0,2.0,2010.0,NaN,NaN,NaN
1,4.394749e+09,NaN,45.753270,4.862953,NaN,NaN,51.0,17.0,28.0,2.0,2010.0,52.0,17.0,28.0,2.0,2010.0,NaN,NaN,NaN
2,4.394695e+09,NaN,45.760655,4.846564,NaN,NaN,29.0,17.0,28.0,2.0,2010.0,33.0,17.0,28.0,2.0,2010.0,NaN,NaN,NaN
3,4.394804e+09,NaN,45.784000,4.874072,NaN,NaN,15.0,20.0,28.0,1.0,2010.0,38.0,12.0,28.0,2.0,2010.0,NaN,NaN,NaN
4,4.394804e+09,NaN,45.784000,4.874072,NaN,NaN,10.0,20.0,28.0,1.0,2010.0,38.0,12.0,28.0,2.0,2010.0,NaN,NaN,NaN

### Missing Values

To check the missing values, several approaches can be used:

1. The `info()` mwthods provides a summary of a dataframe in terms of the types of values, non-null values and memory usage. Thus, by comparing the number of non-null values of each column with the total number of entries, one can have an idea of missing values.
2. Using the [`isna()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.isna.html) method. By summing the resulting values, we obtain the number of null values for each column.
3. To get the rows with any missing values, you can use `isna()` followed by `any(axis=1)`.

In [134]:
print(f"Initial: {len(data)}")
# remove rows with missing values on the columns id, lat, and long
data_cleaned_missing_values = data.dropna(subset=['id', 'lat', 'long'])
print(f"After removing missing values: {len(data_cleaned_missing_values)}")

Initial: 420240
After removing missing values: 420240

### Removing duplicates

In [136]:
# remove duplicates
print(f"Initial: {len(data_cleaned_missing_values)}")
print(data_cleaned_missing_values.duplicated().sum())
data_cleaned_duplicates = data_cleaned_missing_values.drop_duplicates(subset=['id', 'lat', 'long'],keep='first')
# show the stats
print(f"After removing duplicates: {len(data_cleaned_duplicates)}")

Initial: 420240
252139
After removing duplicates: 168097

### Descriptive Statistics

To obtain the statistical summary of the dataframe, we can use [`describe()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.describe.html). For different columns, it displays the count, the average value, the standard deviation, the min and max values, percentiles. 
By default, in mixed data types DataFrames, it displays the values for quantative data only:

In [105]:
data_cleaned_duplicates.describe()

,id,lat,long,date_taken_minute,date_taken_hour,date_taken_day,date_taken_month,date_taken_year,date_upload_day,date_upload_month,date_upload_year,Unnamed: 16,Unnamed: 17,Unnamed: 18
count,1.680970e+05,168097.000000,168097.000000,168097.000000,168097.000000,168097.000000,168097.000000,168097.000000,168096.000000,168097.000000,168096.000000,47.000000,0.0,1.0
mean,1.970867e+10,45.768488,4.839516,29.932592,14.771441,15.054980,7.095724,2013.383445,15.519245,6.849438,2013.734437,1929.893617,NaN,2012.0
std,1.375333e+10,0.028839,0.031621,36.871581,6.934360,9.971281,5.953721,34.036190,8.484994,6.007870,33.675077,407.214783,NaN,NaN
min,3.066675e+08,45.655200,4.720312,0.000000,0.000000,1.000000,1.000000,1.000000,0.000000,1.000000,1.000000,12.000000,NaN,2012.0
25%,7.421252e+09,45.757613,4.826195,14.000000,12.000000,8.000000,4.000000,2012.000000,8.000000,4.000000,2012.000000,2013.000000,NaN,2012.0
50%,1.536710e+10,45.763275,4.832174,30.000000,15.000000,14.000000,7.000000,2014.000000,15.000000,7.000000,2014.000000,2015.000000,NaN,2012.0
75%,3.133939e+10,45.773811,4.846494,45.000000,18.000000,23.000000,10.000000,2017.000000,23.000000,10.000000,2017.000000,2016.000000,NaN,2012.0
max,4.914809e+10,45.854950,5.006709,2019.000000,2013.000000,2013.000000,2011.000000,2238.000000,31.000000,2011.000000,2019.000000,2019.000000,NaN,2012.0

## Prepare data for clustering

First, we will droping the columns user, tag and title because they are not necessary for geographic clustering

In [137]:
df_clustering = data_cleaned_duplicates.drop(columns=['user'])
df_clustering = df_clustering.drop(columns=['tags'])
df_clustering = df_clustering.drop(columns=['title'])

df_clustering.head()

,id,lat,long,date_taken_minute,date_taken_hour,date_taken_day,date_taken_month,date_taken_year,date_upload_minute,date_upload_hour,date_upload_day,date_upload_month,date_upload_year,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,4.395181e+09,45.754858,4.821710,11.0,15.0,28.0,2.0,2010.0,23.0,20.0,28.0,2.0,2010.0,NaN,NaN,NaN
1,4.394749e+09,45.753270,4.862953,51.0,17.0,28.0,2.0,2010.0,52.0,17.0,28.0,2.0,2010.0,NaN,NaN,NaN
2,4.394695e+09,45.760655,4.846564,29.0,17.0,28.0,2.0,2010.0,33.0,17.0,28.0,2.0,2010.0,NaN,NaN,NaN
3,4.394804e+09,45.784000,4.874072,15.0,20.0,28.0,1.0,2010.0,38.0,12.0,28.0,2.0,2010.0,NaN,NaN,NaN
4,4.394804e+09,45.784000,4.874072,10.0,20.0,28.0,1.0,2010.0,38.0,12.0,28.0,2.0,2010.0,NaN,NaN,NaN

Let's apply a [`StandardScaler`](https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html). Recall, that for a given value `x`, a standard score is given by $z = \frac{x - mean(\mathbf{x})}{std(\mathbf{x})}$

In [138]:
# scaler
from sklearn.preprocessing import StandardScaler

In [140]:
# Scale the data
scaler = StandardScaler()
scaled_data = scaler.fit_transform(df_clustering)
# show
print(scaled_data)
# create a DataFrame
scaled_data_df = pd.DataFrame(data=scaled_data, columns=df_clustering.columns)
scaled_data_df.head()

print(len(scaled_data_df))

[[-1.11344157 -0.47263625 -0.56311527 ...         nan         nan
          nan]
 [-1.11347301 -0.52770125  0.74118328 ...         nan         nan
          nan]
 [-1.11347694 -0.27162127  0.22288565 ...         nan         nan
          nan]
 ...
 [ 1.89321808 -1.35201178  3.54303909 ...         nan         nan
          nan]
 [ 1.88839348 -1.35201178  3.54303909 ...         nan         nan
          nan]
 [ 1.83856756  0.11664244 -0.20243528 ...         nan         nan
          nan]]
168097

/Users/simonperret/Library/Python/3.9/lib/python/site-packages/sklearn/utils/extmath.py:1137: RuntimeWarning: invalid value encountered in divide
  updated_mean = (last_sum + new_sum) / updated_sample_count
/Users/simonperret/Library/Python/3.9/lib/python/site-packages/sklearn/utils/extmath.py:1142: RuntimeWarning: invalid value encountered in divide
  T = new_sum / new_sample_count
/Users/simonperret/Library/Python/3.9/lib/python/site-packages/sklearn/utils/extmath.py:1162: RuntimeWarning: invalid value encountered in divide
  new_unnormalized_variance -= correction**2 / new_sample_count